<html>
  <head>
    <title>近文庫alpha</title>
  </head>
  <body>
    <chapter>近デジファイル減量の試み
    <li>概要</li>
    <li>目的</li>
近代デジタルライブラリー(以下、近デジ)のファイルを一冊の本ごとにひとつのファイルとし
それをタブレットにいれ手軽に読めるようにすること

    <li>実現したいこと</li>
file sizeを小さくすること
読みやすい画面を得ること
 タブレットの画面に一ページを無駄なく表示すること
 ノイズを削除すること

    
    <li>やったこと</li>
download file
画像処理による文字の抽出と整列
  opencv + python
    先行事例
    練習
    使えそうな処理の調査
    処理方法の決定
    実装
  文字認識とエンコード
    可能な範囲で市販のOCRソフトを利用
    認識できない文字は画像をそのまま使用
一冊の本のファイル化
  kindle
  epub
  pdf
ライセンスと公開と販売
  toolの公開
  NDLの方針
  オープンデータ
  クリエイティブコモンズ
<li>まとめ</li>
<li>課題</li>
  OCR精度の向上
  Social OCRのとりくみ
    </chapter> 
  </body>
</html>
